Repository: weblate/vfs.rar
Catalog: vfs.rar/resources/language/resource.language.*/strings.po
Languages: es_es, et_ee, fi_fi, hr_hr, it_it, lv_lv, nb_no

# Addon Summary
source: Unarchiver for .rar files
es_es: Descompresor de archivos .rar
et_ee: RAR-failide lahtipakkija
fi_fi: Purkulisäosa -rar-tiedostoille
hr_hr: Raspakiratelj za .rar datoteke
it_it: Estrattore per file .rar
lv_lv: .rar arhīvu atpakotājs
nb_no: Utpakker for .rar-filer

# Addon Description
source: This addon is an extraction utility for RAR archives.[CR][CR]It allows direct reading of uncompressed RAR files, so prior unpacking is not necessary. For all other types, it is temporarily unpacked and passed to Kodi.[CR][CR]Attention: A "Solid RAR" archive type requires complete unpacking to use files within it. Hence access times may be long for larger packages.
es_es: Este addon es una utilidad de extracción para archivos RAR.[CR][CR]Permite leer directamente archivos RAR sin comprimir, así que la descompresión es innecesaria. Para todos los demás tipos, se descomprime temporalmente y se devuelve a Kodi.[CR][CR]Atención: Un "archivo RAR sólido" requiere una descompresión completa para usar los archivos contenidos. Por esto los tiempos de acceso podrían más ser largos para archivos más grandes.
et_ee: See lisamoodul on RAR-arhiivide tööriist.[CR][CR]Ta võimaldab tihendamata RAR-failide otse lugemist, seega pole eelnev lahtipakkimine vajalik. Kõigi muude tüüpide puhul pakitakse see ajutiselt lahti ja edastatakse Kodile.[CR][CR]Tähelepanu: "Solid RAR" arhiivitüüp nõuab selles sisalduvate failide kasutamiseks täielikku lahtipakkimist. Seetõttu võib juurdepääsuaeg suurtes arhiivides asuvatele failidele pikeneda.
fi_fi: Tämä lisäosa on RAR-tiedostojen työkalu.[CR][CR]Se mahdollistaa pakkaamattomien RAR-tiedostojen suoran lukemisen, jolloin pakkaamattomia RAR-tiedostoja ei tarvitse purkaa etukäteen. Kaikki muut tyypit puretaan väliaikaisesti ja välitetään Kodille.[CR][CR]Huomioi: "Solid RAR" -tyyppi vaatii täydellisen purun sen sisältämien tiedostojen käyttämiseksi. Tämän vuoksi suurien tiedostojen käyttöviiveet voivat olla pitkiä.
hr_hr: Ovaj dodatak je pomagalo raspakiravanja za RAR arhive.[CR][CR]Dopušta izravno čitanje nesažetih RAR datoteka, tako da raspakiravanje nije potrebno. Za sve ostale vrste, privremeno su otpakirane i proslijeđene u Kodi.[CR][CR]Upozorenje: "Čvrsta RAR" arhiva zahtjeva potpuno raspakiravanje kako bi koristila sadržane datoteke. Stoga vrijeme pristupa može biti dugo za veće pakete.
it_it: Questo Add-on è un'utilità di estrazione per archivi RAR.[CR][CR]Consente la lettura diretta di file RAR non compressi, quindi non è necessario decomprimere prima. Per tutti gli altri tipi, viene temporaneamente decompresso e passato a Kodi.[CR][CR]Attenzione: un tipo di archivio "Solid RAR" richiede la decompressione completa per utilizzare i file al suo interno. Quindi i tempi di accesso potrebbero essere lunghi per i pacchetti più grandi.
lv_lv: Šis papildinājums ir RAR arhīvu atpakotājs.[CR][CR]Tas ļauj tieši lasīt nesaspiestus RAR failus, tāpēc nav nepieciešama izsaiņošana. Visiem pārējiem arhīva veidiem arhīvs tiek īslaicīgi izsaiņots un dati tiek pārsūtīti uz Kodi.[CR][CR]Uzmanību: Arhīva formātam "Nepārtraukts RAR" ir nepieciešama pilnīga izpakošana, lai varētu izmantot tajā esošos failus. Tāpēc piekļuves laiks failiem, kas atrodas apjomīgos arhīvos, var pieaugt.
nb_no: Denne utvidelsen er et utpakkingsverktøy for RAR-arkiv.[CR][CR]Den gjør det mulig å direkte lese av ukomprimerte RAR-filer uten at utpakking er nødvendig. For alle andre typer, pakkes den ut midlertidig før den sendes til Kodi.[CR][CR]Obs: Et "Solid RAR"-arkiv krever fullstendig utpakking for å bruke filene inni, dermed kan åpning ta lang tid for store pakker.

# #30000
source: RAR file extract
es_es: Extraer archivo RAR
et_ee: RAR faili lahtipakkimine
fi_fi: RAR-tiedostojen purku
hr_hr: RAR datoteka za raspakiravanje
it_it: Estrai file RAR
lv_lv: RAR faila atpakošana
nb_no: Ekstraher RAR-fil

# #30001
source: RAR file scan
es_es: Verificar archivo RAR
et_ee: RAR-failide skaneerimine
fi_fi: RAR-tiedoston tarkistus
hr_hr: RAR datoteka za pretragu
it_it: Scansiona file RAR
lv_lv: RAR failu skenēšana
nb_no: Skann RAR-fil

# #30002
source: RAR solid file scan
es_es: Verificar archivo RAR sólido
et_ee: RAR-solid failide skaneerimine
fi_fi: Solid RAR -tiedostojen tarkistus
hr_hr: RAR čvrsta datoteka za pretragu
it_it: Scansiona file solido RAR
lv_lv: Nepārtraukto RAR faila skenēšana
nb_no: Skann solid RAR-fil

# #30003
source: Enter RAR package password for: %s
es_es: Escribe la contraseña del archivo RAR para: %s
et_ee: Sisesta parool RAR paketile: %s
fi_fi: Syötä RAR-tiedoston salasana: %s
hr_hr: Upiši lozinku RAR paketa za: %s
it_it: Inserisci la password del pacchetto RAR per: %s
lv_lv: Ievadiet RAR arhīva paroli: %s
nb_no: Angi passordet for RAR-arkivet: %s

# #30004
source: Not enough disk space available
es_es: No hay suficiente espacio en disco disponible
et_ee: Kettaruumi pole piisavalt
fi_fi: Tallennusmedialla ei ole riittävästi vapaata tilaa.
hr_hr: Nedovoljno dostupnog diskovnog prostora
it_it: Spazio disponibile su disco insufficiente
lv_lv: Nav pietiekami daudz brīvas vietas diskā
nb_no: Ikke nok diskplass tilgjengelig

# #30010
source: General
et_ee: Üldine
fi_fi: Yleiset
hr_hr: Općenito
it_it: Generale
lv_lv: Vispārīgie
nb_no: Generelt

# #30011
source: Ask for password
es_es: Preguntar contraseña
et_ee: Küsi parooli
fi_fi: Kysy salasanaa
hr_hr: Upitaj za lozinku
it_it: Richiedi la password
lv_lv: Pieprasīt paroli
nb_no: Spør om passord

# #30012
source: If archives are password protected, prompt for the password to be entered
es_es: Si el archivo está protegido por contraseña, pedir que se introduzca la contraseña
et_ee: Kui arhiivid on parooliga kaitstud, küsi parooli
fi_fi: Jos tiedosto on suojattu salasanalla, pyydä salasanaa.
hr_hr: Aku su arhive zaštićene lozinkom, upitaj za upis lozinke
it_it: Se gli archivi sono protetti da password, richiedi l'inserimento della password
lv_lv: Ja arhīvi ir aizsargāti ar paroli, pieprasīt ievadīt paroli
nb_no: Hvis arkivet er passordbeskyttet, be om at passordet skrives inn

# #30013
source: Pre-defined password to attempt decompression with
es_es: Contraseña predefinida con la que intentar descomprimir
et_ee: Eelmääratud parool lahtipakkimiseks
fi_fi: Ennalta määritetty salasana, jolla purkua yritetään.
hr_hr: Preddefinirana lozinka za pokušaj raspakirivanja
it_it: Password predefinita con cui tentare la decompressione
lv_lv: Iepriekš iestatīta parole, ar kuru mēģināt veikt atpakošanu
nb_no: Forhåndsdefinerte passord for å forsøke utpakking

# #30014
source: Stored password 1
es_es: Contraseña almacenada 1
et_ee: Salvestatud parool 1
fi_fi: Tallennettu salasana 1
hr_hr: Spremljena lozinka 1
it_it: Password memorizzata 1
lv_lv: Saglabātā parole 1
nb_no: Lagret passord 1

# #30015
source: Stored password 2
es_es: Contraseña almacenada 2
et_ee: Salvestatud parool 2
fi_fi: Tallennettu salasana 2
hr_hr: Spremljena lozinka 2
it_it: Password memorizzata 2
lv_lv: Saglabātā parole 2
nb_no: Lagret passord 2

# #30016
source: Stored password 3
es_es: Contraseña almacenada 3
et_ee: Salvestatud parool 3
fi_fi: Tallennettu salasana 3
hr_hr: Spremljena lozinka 3
it_it: Password memorizzata 3
lv_lv: Saglabātā parole 3
nb_no: Lagret passord 3

# #30017
source: Stored password 4
es_es: Contraseña almacenada 4
et_ee: Salvestatud parool 4
fi_fi: Tallennettu salasana 4
hr_hr: Spremljena lozinka 4
it_it: Password memorizzata 4
lv_lv: Saglabātā parole 4
nb_no: Lagret passord 4

# #30018
source: Stored password 5
es_es: Contraseña almacenada 5
et_ee: Salvestatud parool 5
fi_fi: Tallennettu salasana 5
hr_hr: Spremljena lozinka 5
it_it: Password memorizzata 5
lv_lv: Saglabātā parole 5
nb_no: Lagret passord 5

# #30019
source: Confirm copy
es_es: Confirmar copia
et_ee: Kinnita
fi_fi: Vahvista kopiointi
hr_hr: Potvrdi kopiranje
it_it: Conferma copia
lv_lv: Apstiprināt kopēšanu
nb_no: Bekreft kopiering

# #30020
source: Need to unpack a big file. Continue?
es_es: Se necesita extraer un fichero grande. ¿Continuar?
et_ee: Lahti pakkida tuleb suur fail. Kas jätkata?
fi_fi: On purettava suuri tiedosto. Jatketaanko?
hr_hr: Potrebno je raspakiravanje velike datoteke. NastavI?
it_it: È necessario decomprimere un file di grandi dimensioni. Continuare?
lv_lv: Nepieciešams atpakot apjomīgu failu. Vai turpināt?
nb_no: En stor fil må pakkes ut. Fortsett?

# #30021
source: Not enough memory available to decompress file
es_es: No hay suficiente memoria disponible para descomprimir el fichero
et_ee: Faili lahtipakkimiseks pole piisavalt mälu
fi_fi: Tiedoston purkuun ei ole riittävästi muistia.
hr_hr: Nedovoljno dostupne memorije za raspakiravanje datoteke
it_it: Memoria disponibile insufficiente per decomprimere il file
lv_lv: Nepietiek atmiņas, lai atpakotu failu
nb_no: Det finnes ikke nok ledig minne til å pakke ut filen

# #30022
source: Passwords
es_es: Contraseñas
et_ee: Paroolid
fi_fi: Salasanat
hr_hr: Lozinke
it_it: Password
lv_lv: Paroles
nb_no: Passord

# #30023
source: Asks to unpack
es_es: Preguntar para descomprimir
et_ee: Kinnita lahtipakkimine
fi_fi: Vahvista purku
hr_hr: Upitaj za raspakiravanje
it_it: Chiedi per decomprimere
lv_lv: Jautā atpakot
nb_no: Spør deg om du vil pakke ut filen

# #30024
source: Asks you with a dialog to confirm the unpacking of a larger file.
es_es: Pide con un diálogo confirmar la descompresión de un fichero grande.
et_ee: Küsib kinnitust enne suurte failide lahtipakkimist.
fi_fi: Kysyy vahvistuksen ennen suurten tiedostojen purkua.
hr_hr: Upit s dijalogom za potvrdu raspakiravanje veće datoteke.
it_it: Ti chiede con una finestra di dialogo di confermare la decompressione di un file più grande.
lv_lv: Prasa dialoglogu, lai apstiprinātu apjomīga faila atpakošanu.
nb_no: Viser en dialog for å bekrefte om du vil pakke ut store filer.
